[
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_1.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_2.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_3.png",
        "transcripts": [
            " European speakers to arrive on the landmass, now called England, were probably the Celts. We do not know exactly the date of their arrival, but they were already on the British Isles several centuries before the birth of Christ. Beginning in 55 before Christ, Julius Caesar, the Roman Emperor, made several attempts to invade Britain, but it was not before 50 after Christ that most of the land was under Roman domination, except for the northern part which remained unconquered. Hadrian's Wall represents the borderline, England became Rome's west and most outpost and was gradually Romanised. In 410 after Christ, the Roman legions were withdrawn from Britain, leaving chaos. The pits raided from the north, and the Scots from Ireland, while the dunes and the Saxons attacked the eastern coasts. Throughout the fifth and sixth century, the Britons were slowly driven back into the mountain areas of Cambria and Wales. Germanic-speaking tribes replaced the Celtic peoples. The earliest period in the history of the English language is referred to as the Old English period. And the origin of this Old English period goes back to the fifth century after Christ when Germanic tribes invaded Britain. These tribes were the Saxons, the Angles and the Dutes. The Old English period is generally defined as from 600 to 1100 after Christ. Due to the strong Germanic and especially the strong Saxon influence, the Old English period is often also referred to as Anglo-Saxon English. Its geographical extension was approximately identical with today's area of England. It gets ancestor languages, Old English was synthetic, with numerous agglutinating tendencies. It inherited most phonological and morphological properties from Germanic and had a relatively free word order. Let's listen to an example. The flawed Utejibat, the flotans stored in Yerova, waking a fella, V.S. Yerna, hate fa halada, hale, held on fa britche, we and we hurtna, sei wes haten wustan, calvna, midhis quinna. That was calon sumu, sei thon a forman man, midhis flanken of shat, fair, baldly coast on fa britche stoop, fair, stodon mid wustan, wien un forte, alvera and macos, mo dietwein. The beginning of the middle English period coincides with the battle of Hastings. The key event in the Norman conquest of England, when William, Duke of Normandy, after the battle known as William the Conqueror, defeated the English under King Harold II in October 1066. The Norman conquest brought massive changes to England's political and social structures and it had an enormous impact on the English language. After the Norman conquest, England's social and political structures underwent dramatic changes such as an almost complete replacement of the English aristocracy by a Norman aristocracy. English largely lost its status and became the language of the lower classes, especially among the nobility in literature, law and in official documentation, it essentially disappeared as a written language. Thank you."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_4.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_5.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_6.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_7.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_8.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_9.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_10.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_11.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_12.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_13.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_14.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_15.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_16.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_17.png",
        "transcripts": [
            " Yeah,1204 marks the turning point when King John, nicknamed John Lackland, lost his English possessions in France, leading to a gradual decline of French as an official language in England. By the 13th and 14th centuries, even the children of the English nobility no longer learned French as a native language. English had become the new medium of instruction. Although French remained the official language of England, well into the 14th century, two events of that time sealed its fate. The first was the Black Death. When between 1348 and 1351, one third of the people in England died. This led to enormous labor shortages and an increase of the prestige of English, which was the language of the working class. Another event was the..."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_18.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_19.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_20.png",
        "transcripts": [
            " A hundred years' war from 1337 to 1353, which led to a loss of all continental holdings without which the English no longer had important reasons for learning and using French. The end of the Middle English period is marked by several historical incidents where the first two had an enormous impact on the development of English. The introduction of the printing press to England in 1476 by William Caxton, which led to a standardisation of the English language and the"
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_21.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_22.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_23.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_24.png",
        "transcripts": [
            " beginning of colonization after 1500, after the discovery of America in 1492, which eventually led to a global spread of the English language. And then of course, the inauguration of Henry VIII in 1509, who eventually cut the links to Rome and the Catholic Church. So by 1500, English had begun to obtain a new position from a regional European language to a global system of communication. Due to Latin and French influences, a new language had involved by the mid-14th century. Middle English was Germanic at the core, but had an extensive Roman vocabulary. Furthermore, in middle English, the structural complexity of old English had disappeared. The many linguistic developments which identify the Middle English period are most evident in the poetry and prose of the second half of the 14th century."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_25.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_26.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_27.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_28.png",
        "transcripts": [
            " Let's listen to an example from Middle English from the Canterbury Tales written by Jeffrey Chaucer. One that April, with his show, the drought of March, has paraceted to the rotor and barbed every then in switch liqueur, of which virtue and gendered is the floor one zephyrus eek with his sway to brace, in spirit has, in every hold and hast. The tender croppers and the younger sauna have in the ram, his halve course, uronner, and smile, folds, mark and melodia that's sleeping out the knee with open ear. So, pricketh him, naturin here, carages, than a long and folk to go on, on pilgrimages, and palm rest for to say, constron just round us, to fairen the harvest, cools in sundry londis. The beginning of the early modern English period coincides with the ascendancy of Henry VIII to the throne in 1509. The end of the early modern English period is marked by the completion of the great vowel shift and the beginning of the scientific age at around 1700. Most influential."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_29.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_30.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_31.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_32.png",
        "transcripts": [
            " Still with regard to early modern English, where the works of William Shakespeare. For this reason, early modern English is often alternatively referred to as Shakespearean English. By the end of the Middle English period, most of today's syntactic and morphological patterns had been established. Early modern English was fairly analytic. The word order had already become quite fixed to subject, verb, object, due to a reduced inflection system. And of the five old English cases, only two had survived. The great change that classifies early modern English as a new period is mainly phonological in nature. Between 1450 and 1650, five of the seven long vowels of Middle English were raised and two became dephthongized. This great vowel shift finally made English intelligible to the modern ear. The revival of classical scholarship during the Renaissance brought Latin and Greek long words into the language. Scientific writers were often in need of new words, and thus borrowed in abundance from these languages. Not all of these borrowings though survived. Anyway, let us in a second."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_33.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_34.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_35.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_36.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_37.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_38.png",
        "transcripts": [
            " Straight early modern English, using an example from Shakespeare's set of sonnets. Here is sonnet number 18. Shall I compare thee to Sumer's Day? Though art more lovely and more temperate, roof wings do shake the darling boots of may, and Sumer's legs have all too short a date. Some time too hot, the A of heaven shines, and often is his gold complexion dimmed, and every fair from fair, some time declines. By chance, ornate, just changing course on trimmed. But the eternal Sumer shall not fade, nor those possession of that fair, though oost, nor shall death brag, though wondrous in his shed, when in eternal lanes to tame, though gross. So long as man can breathe, or as can see. So long lives this, and this gives life to thee."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_39.png",
        "transcripts": [
            " By about 1700, the English language differed only slightly from present-day English. The most important development was external. It concerned the position of the English language among the languages of the world. From a regional language, it developed to the most widely used language of our time."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_40.png",
        "transcripts": [
            " The first significant step in the progress of English towards its status as a global language did not take place before the end of the 16th century. By the end of the reign of Elizabeth I, in 1603, literature had boomed through the works of Spencer, Marlowe and Shakespeare, and Francis Drake and Walter Raleigh had laid the foundation for expanding the English influences in the New World. Today the spread of English around the world is often defined in terms of three concentric circles. The inner circle refers to traditional historical and socio-linguistic origins of English where it is used as a first or native language. The outer circle includes countries colonized by Britain and the United States where English is spoken as a second language and where it plays an important historical and governmental role in multilingual settings. The countries in the expanding circle did not institutionalize English as an official language but recognized the important of English as a foreign language."
        ],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_41.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_42.png",
        "transcripts": [],
        "summaries": [],
        "squashed": true
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_43.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_44.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    },
    {
        "slide": "/root/data/ef4f8bf6-1df1-4d3e-9eb8-72e401d4e22c/slides/_page_45.png",
        "transcripts": [],
        "summaries": [],
        "squashed": false
    }
]